from math import sqrt
from math import tan
print("Введите радиус круга:")
c = int(input())
a = PI = 3.14
print("Длина окружности:", 2*PI*c, "см и", 2*PI*(c/100), "м")
print("Площадь круга:", PI*c**2, "cм^2 и", PI*(c/100)**2, "м^2")
print("Сторона вписанного квадрата:", c*sqrt(2), "см")
print("Сторона вписанного треугольника:", c*sqrt(3), "см")
print("Сторона описанного треугольника:", c*2*sqrt(3), "см")
print("Сторона описанного квадрата:", 2*c, "см")
print("Сторона описанного восьмиугольника:", 2*tan(180/8)*c, "см")